Link : https://github.com/codebasics/py/blob/master/pandas/8_concat/pandas_concat.ipynb

In [1]:
import pandas as pd
import numpy as np

In [9]:
india_weather = pd.DataFrame({
        'city':['mumbai','delhi','banglore'],
        'temperature':[32,45,30],
        'humidity':[80,60,70]
})

In [10]:
india_weather.head()

       city  humidity  temperature
0    mumbai        80           32
1     delhi        60           45
2  banglore        70           30

us_weather = pd.DataFrame({
    'city':['newyork','florida','texas'],
    'temperature':[21,14,35],
    'humidity':[68,65,75]
})
us_weather

In [12]:
df_concat = pd.concat([india_weather, us_weather])
df_concat

       city  humidity  temperature
0    mumbai        80           32
1     delhi        60           45
2  banglore        70           30
0   newyork        68           21
1   florida        65           14
2     texas        75           35

In [13]:
# we can ingnore the indices as follows:
df_concat = pd.concat([india_weather,us_weather], ignore_index = True)
df_concat

       city  humidity  temperature
0    mumbai        80           32
1     delhi        60           45
2  banglore        70           30
3   newyork        68           21
4   florida        65           14
5     texas        75           35

In [15]:
# using keys for individual datasets
df = pd.concat([india_weather,us_weather], keys = ['india','us'])
df

             city  humidity  temperature
india 0    mumbai        80           32
      1     delhi        60           45
      2  banglore        70           30
us    0   newyork        68           21
      1   florida        65           14
      2     texas        75           35

In [16]:
# retriving the values of the dataset
df.loc['india']

       city  humidity  temperature
0    mumbai        80           32
1     delhi        60           45
2  banglore        70           30

In [17]:
df.loc['us']

      city  humidity  temperature
0  newyork        68           21
1  florida        65           14
2    texas        75           35

In [18]:
temperature_df = pd.DataFrame({
    "city": ["mumbai","delhi","banglore"],
    "temperature": [32,45,30],
}, index=[0,1,2]) # indices are important to evenly add values when concating row wise
temperature_df

       city  temperature
0    mumbai           32
1     delhi           45
2  banglore           30

In [19]:
windspeed_df = pd.DataFrame({
    "city": ["delhi","mumbai"],
    "windspeed": [7,12],
}, index=[1,0])
windspeed_df

     city  windspeed
1   delhi          7
0  mumbai         12

In [20]:
# concating two dataframes column wise using axis = 1

df = pd.concat([temperature_df,windspeed_df], axis=1)
df

       city  temperature    city  windspeed
0    mumbai           32  mumbai       12.0
1     delhi           45   delhi        7.0
2  banglore           30     NaN        NaN

In [23]:
# concating series data with a dataframe
s = pd.Series(['Humid','Dry','Rainy','Cold'], name = 'event')
s

0    Humid
1      Dry
2    Rainy
3     Cold
Name: event, dtype: object

In [25]:
df = pd.concat([temperature_df, s], axis = 1)
df

       city  temperature  event
0    mumbai         32.0  Humid
1     delhi         45.0    Dry
2  banglore         30.0  Rainy
3       NaN          NaN   Cold